jasonkajita/pic32-part-support/include/proc/p32mx470f512lb.h
#define _I2CABCON_STRICT_POSITION                0x0000000B
#define _I2CABCON_STRICT_MASK                    0x00000800
#define _I2CABCON_STRICT_LENGTH                  0x00000001

#define _I2CABCON_SCLREL_POSITION                0x0000000C
#define _I2CABCON_SCLREL_MASK                    0x00001000
#define _I2CABCON_SCLREL_LENGTH                  0x00000001

#define _I2CABCON_SIDL_POSITION                  0x0000000D
#define _I2CABCON_SIDL_MASK                      0x00002000
#define _I2CABCON_SIDL_LENGTH                    0x00000001

#define _I2CABCON_ON_POSITION                    0x0000000F
#define _I2CABCON_ON_MASK                        0x00008000
#define _I2CABCON_ON_LENGTH                      0x00000001

#define _I2CABCON_IPMIEN_POSITION                0x0000000B
#define _I2CABCON_IPMIEN_MASK                    0x00000800
#define _I2CABCON_IPMIEN_LENGTH                  0x00000001

#define _I2CABCON_I2CSIDL_POSITION               0x0000000D
#define _I2CABCON_I2CSIDL_MASK                   0x00002000
#define _I2CABCON_I2CSIDL_LENGTH                 0x00000001

#define _I2CABCON_I2CEN_POSITION                 0x0000000F
#define _I2CABCON_I2CEN_MASK                     0x00008000
#define _I2CABCON_I2CEN_LENGTH                   0x00000001

#define _I2CABCON_w_POSITION                     0x00000000
#define _I2CABCON_w_MASK                         0xFFFFFFFF
#define _I2CABCON_w_LENGTH                       0x00000020

#define _I2C2STAT_TBF_POSITION                   0x00000000
#define _I2C2STAT_TBF_MASK                       0x00000001
#define _I2C2STAT_TBF_LENGTH                     0x00000001

#define _I2C2STAT_RBF_POSITION                   0x00000001
#define _I2C2STAT_RBF_MASK                       0x00000002
#define _I2C2STAT_RBF_LENGTH                     0x00000001

#define _I2C2STAT_R_W_POSITION                   0x00000002
#define _I2C2STAT_R_W_MASK                       0x00000004
#define _I2C2STAT_R_W_LENGTH                     0x00000001

#define _I2C2STAT_S_POSITION                     0x00000003
#define _I2C2STAT_S_MASK                         0x00000008
#define _I2C2STAT_S_LENGTH                       0x00000001

#define _I2C2STAT_P_POSITION                     0x00000004
#define _I2C2STAT_P_MASK                         0x00000010
#define _I2C2STAT_P_LENGTH                       0x00000001

#define _I2C2STAT_D_A_POSITION                   0x00000005
#define _I2C2STAT_D_A_MASK                       0x00000020
#define _I2C2STAT_D_A_LENGTH                     0x00000001

#define _I2C2STAT_I2COV_POSITION                 0x00000006
#define _I2C2STAT_I2COV_MASK                     0x00000040
#define _I2C2STAT_I2COV_LENGTH                   0x00000001

#define _I2C2STAT_IWCOL_POSITION                 0x00000007
#define _I2C2STAT_IWCOL_MASK                     0x00000080
#define _I2C2STAT_IWCOL_LENGTH                   0x00000001

#define _I2C2STAT_ADD10_POSITION                 0x00000008
#define _I2C2STAT_ADD10_MASK                     0x00000100
#define _I2C2STAT_ADD10_LENGTH                   0x00000001

#define _I2C2STAT_GCSTAT_POSITION                0x00000009
#define _I2C2STAT_GCSTAT_MASK                    0x00000200
#define _I2C2STAT_GCSTAT_LENGTH                  0x00000001

#define _I2C2STAT_BCL_POSITION                   0x0000000A
#define _I2C2STAT_BCL_MASK                       0x00000400
#define _I2C2STAT_BCL_LENGTH                     0x00000001

#define _I2C2STAT_TRSTAT_POSITION                0x0000000E
#define _I2C2STAT_TRSTAT_MASK                    0x00004000
#define _I2C2STAT_TRSTAT_LENGTH                  0x00000001

#define _I2C2STAT_ACKSTAT_POSITION               0x0000000F
#define _I2C2STAT_ACKSTAT_MASK                   0x00008000
#define _I2C2STAT_ACKSTAT_LENGTH                 0x00000001

#define _I2C2STAT_I2CPOV_POSITION                0x00000006
#define _I2C2STAT_I2CPOV_MASK                    0x00000040
#define _I2C2STAT_I2CPOV_LENGTH                  0x00000001

#define _I2C2STAT_w_POSITION                     0x00000000
#define _I2C2STAT_w_MASK                         0xFFFFFFFF
#define _I2C2STAT_w_LENGTH                       0x00000020

#define _I2CABSTAT_TBF_POSITION                  0x00000000
#define _I2CABSTAT_TBF_MASK                      0x00000001
#define _I2CABSTAT_TBF_LENGTH                    0x00000001

#define _I2CABSTAT_RBF_POSITION                  0x00000001
#define _I2CABSTAT_RBF_MASK                      0x00000002
#define _I2CABSTAT_RBF_LENGTH                    0x00000001

#define _I2CABSTAT_R_W_POSITION                  0x00000002
#define _I2CABSTAT_R_W_MASK                      0x00000004
#define _I2CABSTAT_R_W_LENGTH                    0x00000001

#define _I2CABSTAT_S_POSITION                    0x00000003
#define _I2CABSTAT_S_MASK                        0x00000008
#define _I2CABSTAT_S_LENGTH                      0x00000001

#define _I2CABSTAT_P_POSITION                    0x00000004
#define _I2CABSTAT_P_MASK                        0x00000010
#define _I2CABSTAT_P_LENGTH                      0x00000001

#define _I2CABSTAT_D_A_POSITION                  0x00000005
#define _I2CABSTAT_D_A_MASK                      0x00000020
#define _I2CABSTAT_D_A_LENGTH                    0x00000001

#define _I2CABSTAT_I2COV_POSITION                0x00000006
#define _I2CABSTAT_I2COV_MASK                    0x00000040
#define _I2CABSTAT_I2COV_LENGTH                  0x00000001

#define _I2CABSTAT_IWCOL_POSITION                0x00000007
#define _I2CABSTAT_IWCOL_MASK                    0x00000080
#define _I2CABSTAT_IWCOL_LENGTH                  0x00000001

#define _I2CABSTAT_ADD10_POSITION                0x00000008
#define _I2CABSTAT_ADD10_MASK                    0x00000100
#define _I2CABSTAT_ADD10_LENGTH                  0x00000001

#define _I2CABSTAT_GCSTAT_POSITION               0x00000009
#define _I2CABSTAT_GCSTAT_MASK                   0x00000200
#define _I2CABSTAT_GCSTAT_LENGTH                 0x00000001

#define _I2CABSTAT_BCL_POSITION                  0x0000000A
#define _I2CABSTAT_BCL_MASK                      0x00000400
#define _I2CABSTAT_BCL_LENGTH                    0x00000001

#define _I2CABSTAT_TRSTAT_POSITION               0x0000000E
#define _I2CABSTAT_TRSTAT_MASK                   0x00004000
#define _I2CABSTAT_TRSTAT_LENGTH                 0x00000001

